0/O2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      YO2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];
internalField   uniform 0.2;
boundaryField
{
    INLET_AIR
    {
        type fixedValue;
        value uniform 0.23;
    }
    INLET_NH3
    {
        type fixedValue;
        value uniform 0;
    }
    OUTLET_AIR
    {
        type zeroGradient;
    }
    WALL_BUILDING
    {
        type zeroGradient;
    }
    WALL_SIDE_01
    {
        type zeroGradient;
    }
    WALL_SIDE_02
    {
        type zeroGradient;
    }
    WALL_TOP
    {
        type zeroGradient;
    }
    WALL_BOTTOM
    {
        type zeroGradient;
    }
}
