0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);
boundaryField
{
    INLET_AIR
    {
        type fixedValue;
        value uniform (1 0 0);
    }
    INLET_NH3
    {
        type fixedValue;
        value uniform (0 0 10);
    }
    OUTLET_AIR
    {
        type zeroGradient;
    }
    WALL_BUILDING
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    WALL_SIDE_01
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    WALL_SIDE_02
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    WALL_TOP
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    WALL_BOTTOM
    {
        type fixedValue;
        value uniform (0 0 0);
    }
}
