0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.01;

boundaryField
{
    INLET_NH3
    {
        type            fixedValue;
        value           uniform 0.01;
    }

    INLET_AIR
    {
        type            fixedValue;
        value           uniform 0.01;
    }

    OUTLET_AIR
    {
        type            zeroGradient;
    }

    WALL_BUILDING
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }

    WALL_SIDE_01
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }

    WALL_SIDE_02
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }

    WALL_TOP
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }

    WALL_BOTTOM
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }
}

