0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 1e-05;
boundaryField
{
    INLET_AIR
    {
        type calculated;
        value uniform 1e-05;
    }
    INLET_NH3
    {
        type calculated;
        value uniform 1e-05;
    }
    OUTLET_AIR
    {
        type calculated;
        value uniform 1e-05;
    }
    WALL_BUILDING
    {
        type nutkWallFunction;
        value uniform 1e-05;
    }
    WALL_SIDE_01
    {
        type nutkWallFunction;
        value uniform 1e-05;
    }
    WALL_SIDE_02
    {
        type nutkWallFunction;
        value uniform 1e-05;
    }
    WALL_TOP
    {
        type nutkWallFunction;
        value uniform 1e-05;
    }
    WALL_BOTTOM
    {
        type nutkWallFunction;
        value uniform 1e-05;
    }
}
