0/p
/*--------------------------------*- C++ -*----------------------------------*\\
  =========                 |
  \\\\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\\\    /   O peration     | Website:  https://openfoam.org
    \\\\  /    A nd           | Version:  8
     \\\\/     M anipulation  |
\\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 101325;
boundaryField
{
    INLET_AIR
    {
        type calculated;
        value uniform 101325;
    }
    INLET_NH3
    {
        type calculated;
        value uniform 101325;
    }
    OUTLET_AIR
    {
        type calculated;
        value uniform 101325;
    }
    WALL_BUILDING
    {
        type calculated;
        value uniform 101325;
    }
    WALL_SIDE_01
    {
        type calculated;
        value uniform 101325;
    }
    WALL_SIDE_02
    {
        type calculated;
        value uniform 101325;
    }
    WALL_TOP
    {
        type calculated;
        value uniform 101325;
    }
    WALL_BOTTOM
    {
        type calculated;
        value uniform 101325;
    }
}

