0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 101325;
boundaryField
{
    INLET_AIR
    {
        type zeroGradient;
    }
    INLET_NH3
    {
        type zeroGradient;
    }
    OUTLET_AIR
    {
        type fixedValue;
        value uniform 101325;
    }
    WALL_BUILDING
    {
        type zeroGradient;
    }
    WALL_SIDE_01
    {
        type zeroGradient;
    }
    WALL_SIDE_02
    {
        type zeroGradient;
    }
    WALL_TOP
    {
        type zeroGradient;
    }
    WALL_BOTTOM
    {
        type zeroGradient;
    }
}
