constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}

// ************************************************************************* //

thermoType
{
    type            heRhoThermo;
    mixture         multiComponentMixture;
    transport       sutherland;
    thermo          janaf;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

inertSpecie N2;

species ( NH3 O2 N2 );

NH3
{
    specie
    {
        molWeight 17.031;
    }
    thermodynamics
    {
        Tlow 200;
        Thigh 5000;
        Tcommon 1000;
        highCpCoeffs (2.634 0.01054 -3.183e-06 4.658e-10 -2.362e-14 -1.305 29.34);
        lowCpCoeffs  (4.286 -0.00283 1.623e-05 -2.032e-08 8.193e-12 -0.687 19.91);
    }
    transport
    {
        As 1.67212e-06;
        Ts 170.672;
    }
}

O2
{
    specie
    {
        molWeight 32.00;
    }
    thermodynamics
    {
        Tlow 200;
        Thigh 3500;
        Tcommon 1000;
        highCpCoeffs (3.28254 0.00148309 -7.57967e-07 2.09471e-10 -2.16718e-14 -1088.46 5.45323);
        lowCpCoeffs  (3.78246 -0.00299673 9.8473e-06 -9.6813e-09 3.24373e-12 -1063.94 3.65768);
    }

    transport
    {
        As 2.072e-06;
        Ts 300.0;
    }

}

N2
{
    specie
    {
        molWeight 28.0134;
    }
    thermodynamics
    {
        Tlow 200;
        Thigh 3500;
        Tcommon 1000;
        highCpCoeffs (2.95258 0.0013969 -4.92632e-07 7.8601e-11 -4.60755e-15 -923.949 5.87189);
        lowCpCoeffs  (3.53101 -0.000123661 -5.02999e-07 2.43531e-09 -1.40881e-12 -1046.98 2.96747);
    }
    transport
    {
        As 1.663e-06;
        Ts 300.0;
    }
}
